# ContourLabelsPrimaryOnly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContourLabelsPrimaryOnly Property
ParameterTypeId Class See Also
---
"Label primary contours only"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContourLabelsPrimaryOnly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContourLabelsPrimaryOnly As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContourLabelsPrimaryOnly {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace